results/isolation_test/phase_6_run_4_raw.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 798.71 qps: 15978.84 (r/w/o: 11186.07/3194.95/1597.82) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 756.70 qps: 15134.59 (r/w/o: 10594.09/3027.10/1513.40) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 757.68 qps: 15151.20 (r/w/o: 10605.55/3030.30/1515.35) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 763.55 qps: 15272.41 (r/w/o: 10691.03/3054.28/1527.09) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 761.77 qps: 15232.96 (r/w/o: 10662.52/3046.99/1523.45) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 756.27 qps: 15128.29 (r/w/o: 10589.75/3025.90/1512.65) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            643580
        write:                           183880
        other:                           91940
        total:                           919400
    transactions:                        45970  (765.81 per sec.)
    queries:                             919400 (15316.19 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0271s
    total number of events:              45970

Latency (ms):
         min:                                    2.36
         avg:                                    5.22
         max:                                   50.05
         99th percentile:                       44.17
         sum:                               239851.65

Threads fairness:
    events (avg/stddev):           11492.5000/26.20
    execution time (avg/stddev):   59.9629/0.00